Revit 2026 API

# GradientBackgroundSettingsGroundColor Property

---

The color of the ground.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color GroundColor { get; set; }
```
```vb
Public Property GroundColor As Color
	Get
	Set
```
```cpp
public:
property Color^ GroundColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member GroundColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

GradientBackgroundSettings Class

Autodesk.Revit.DB Namespace